[
  {
    "title": "[85] [Astrobiology] The Evolution in Coma Molecular Composition of Comet C/2017 K2 (PanSTARRS) Across the H2O Sublimation Zone: ALMA Imaging of an H2O-Dominated Coma",
    "link": "https://astrobiology.com/2025/12/the-evolution-in-coma-molecular-composition-of-comet-c-2017-k2-panstarrs-across-the-h2o-sublimation-zone-alma-imaging-of-an-h2o-dominated-coma.html",
    "score": 85,
    "summary": "This study investigates the molecular composition of comet C/2017 K2, emphasizing the role of water sublimation in understanding the origins of life in the solar system.",
    "abstract": "<strong>Score:</strong> 85/100 | <strong>Category:</strong> Astrobiology<br /> \n        <strong>AI Summary:</strong> This study provides insights into the molecular composition of comet C/2017 K2, highlighting the significance of water sublimation and its implications for understanding the origins of life in the solar system.<br /> \n        <hr /> \n        <strong>Abstract:</strong><br /> \n        We report a survey of molecular emission from cometary volatiles using the Atacama Large Millimeter/Submillimeter Array (ALMA) toward comet C/2017 K2 (PanSTARRS) carried out on UT 2022 September 21, 22, and 23 at a heliocentric distance (rh) of 2.1 au. These measurements of HCN, CS, CO, CH3OH, and H2CO (along with continuum emission from dust) […] The post The Evolution in Coma Molecular Composition of Comet C/2017 K2 (PanSTARRS) Across the H2O Sublimation Zone: ALMA Imaging of an H2O-Dominated Coma appeared first on Astrobiology .<br /> \n        <br /> \n        <a href=\"https://astrobiology.com/2025/12/the-evolution-in-coma-molecular-composition-of-comet-c-2017-k2-panstarrs-across-the-h2o-sublimation-zone-alma-imaging-of-an-h2o-dominated-coma.html\">Read Full Paper</a>",
    "published": "2025-12-30T03:45:19+00:00"
  },
  {
    "title": "[81] [Computational Biology] RAMBO: Resolving Amplicons in Mixed Samples for Accurate DNA Barcoding with Oxford Nanopore",
    "link": "https://www.biorxiv.org/content/10.64898/2025.12.29.694971v1?rss=1",
    "score": 81,
    "summary": "The paper introduces a novel DNA barcoding pipeline using Nanopore sequencing that enhances species identification accuracy in complex biological samples, which is crucial for understanding biodiversity and potential biosignatures in astrobiological contexts.",
    "abstract": "<strong>Score:</strong> 81/100 | <strong>Category:</strong> Computational Biology<br /> \n        <strong>AI Summary:</strong> The paper presents a novel pipeline for DNA barcoding using Nanopore sequencing that effectively resolves mixed sequence signals, enhancing the accuracy of species identification in complex biological samples.<br /> \n        <hr /> \n        <strong>Abstract:</strong><br /> \n        DNA barcoding, the use of short genetic markers to identify and differentiate species, is a foundational tool in ecological and taxonomic research. The method has scaled rapidly with next-generation sequencing technologies, enabling the processing of thousands of specimens in parallel. Nanopore sequencing offers a flexible, low-cost alternative to other platforms, producing full-length reads in real time and supporting applications in remote settings. However, its comparatively high error rate complicates downstream processing, particularly when PCR co-amplifies multiple templates from a single specimen, reflecting pseudogenes, paralogs, or contaminants. We present a novel pipeline for DNA barcoding that resolves mixed sequence signals from Nanopore reads using unsupervised clustering and staged consensus generation, without relying on curated reference databases, taxonomic priors, or error models. Unlike existing approaches to curate Nanopore sequence data that assume a single dominant amplicon per sample or require large sequence divergence among amplicons, our method distinguishes variants differing by 0.15 percent. It combines column-weighted encodings, UMAP projection, and HDBSCAN clustering, followed by conservative consensus refinement. The pipeline was benchmarked and validated using datasets with known composition, including high-fidelity PacBio sequences. The results show that Nanopore barcoding, when paired with appropriate analysis tools, can recover biologically meaningful variation even in technically complex samples. The pipeline is particularly suited for specimens where divergent templates are often co-amplified, including mitochondrial pseudogenes or multicopy nuclear regions like ITS. As such, it provides a generalizable framework for high-resolution Nanopore analysis of complex amplicon data.<br /> \n        <br /> \n        <a href=\"https://www.biorxiv.org/content/10.64898/2025.12.29.694971v1?rss=1\">Read Full Paper</a>",
    "published": "2025-12-30T03:45:19+00:00"
  },
  {
    "title": "[81] [Unclassified] LinearCapR: Linear-time computation of per-nucleotide structural-context probabilities of RNA without base-pair span limits",
    "link": "https://www.biorxiv.org/content/10.64898/2025.12.26.696559v1?rss=1",
    "score": 81,
    "summary": "The paper introduces LinearCapR, a computational tool that enhances RNA structural analysis by providing linear-time, span-unrestricted probabilities of structural contexts, which is crucial for understanding RNA's role in abiogenesis.",
    "abstract": "<strong>Score:</strong> 81/100 | <strong>Category:</strong> Unclassified<br /> \n        <strong>AI Summary:</strong> The paper presents a novel computational tool for RNA structural analysis, which is relevant to understanding the molecular mechanisms that could inform abiogenesis pathways in astrobiology.<br /> \n        <hr /> \n        <strong>Abstract:</strong><br /> \n        Motivation: RNA molecules adopt dynamic ensembles of secondary structures, where the local structural context of each nucleotide--such as whether it resides in a stem or a specific type of loop--strongly shapes molecular interactions and regulatory function. Structural-context probabilities therefore provide a more functionally informative view of RNA folding than the minimum free energy structures or base-pairing probabilities. However, existing tools either require O(N3) time or employ span-restricted approximations that omit long-range base-pairs, limiting their applicability to large and biologically important RNAs. Results: We introduce LinearCapR, enabling linear-time, span-unrestricted computation of structural-context marginalized probabilities, using beam-pruned Stochastic Context Free Grammar-based computation. LinearCapR retains global ensemble features lost by span-limited methods and yields superior predictive power on bpRNA-1m(90) dataset, especially for multiloops and exterior regions, as well as long-distance stems. LinearCapR supports analysis of long RNAs, demonstrated on the full genome of SARS-CoV-2. Conclusions: LinearCapR provides the first base-pair-span-unrestricted, linear-time framework for RNA structural context analysis, retaining key thermodynamic ensemble features essential for functional interpretation. It enables large-scale studies of viral genomes, long non-coding RNAs, and downstream analyses such as RNA-binding protein site prediction. Availability: The source code of LinearCapR is available at https://github.com/hoget157/LinearCapR.<br /> \n        <br /> \n        <a href=\"https://www.biorxiv.org/content/10.64898/2025.12.26.696559v1?rss=1\">Read Full Paper</a>",
    "published": "2025-12-30T03:45:19+00:00"
  },
  {
    "title": "LinearCapR: Linear-time computation of per-nucleotide structural-context probabilities of RNA without base-pair span limits",
    "link": "https://www.biorxiv.org/content/10.64898/2025.12.26.696559v1?rss=1",
    "score": 85,
    "summary": "The introduction of LinearCapR offers a significant advancement in RNA structural-context analysis, enabling the study of large RNA molecules and their functional implications, which is crucial for understanding the origins of life and the evolution of complex biological systems.",
    "abstract": "<p><img alt=\"biorxiv_logo_homepage7-5-small.png\" src=\"https://www.biorxiv.org/sites/default/files/images/biorxiv_logo_homepage7-5-small.png\" /></p>Motivation: RNA molecules adopt dynamic ensembles of secondary structures, where the local structural context of each nucleotide--such as whether it resides in a stem or a specific type of loop--strongly shapes molecular interactions and regulatory function. Structural-context probabilities therefore provide a more functionally informative view of RNA folding than the minimum free energy structures or base-pairing probabilities. However, existing tools either require O(N3) time or employ span-restricted approximations that omit long-range base-pairs, limiting their applicability to large and biologically important RNAs. Results: We introduce LinearCapR, enabling linear-time, span-unrestricted computation of structural-context marginalized probabilities, using beam-pruned Stochastic Context Free Grammar-based computation. LinearCapR retains global ensemble features lost by span-limited methods and yields superior predictive power on bpRNA-1m(90) dataset, especially for multiloops and exterior regions, as well as long-distance stems. LinearCapR supports analysis of long RNAs, demonstrated on the full genome of SARS-CoV-2. Conclusions: LinearCapR provides the first base-pair-span-unrestricted, linear-time framework for RNA structural context analysis, retaining key thermodynamic ensemble features essential for functional interpretation. It enables large-scale studies of viral genomes, long non-coding RNAs, and downstream analyses such as RNA-binding protein site prediction. Availability: The source code of LinearCapR is available at https://github.com/hoget157/LinearCapR.",
    "published": "2025-12-30T02:13:31+00:00"
  },
  {
    "title": "RAMBO: Resolving Amplicons in Mixed Samples for Accurate DNA Barcoding with Oxford Nanopore",
    "link": "https://www.biorxiv.org/content/10.64898/2025.12.29.694971v1?rss=1",
    "score": 75,
    "summary": "The paper presents a novel DNA barcoding pipeline that enhances the resolution of mixed genetic samples using Nanopore sequencing, which could improve our understanding of biodiversity and evolutionary processes relevant to the origins of life.",
    "abstract": "<p><img alt=\"biorxiv_logo_homepage7-5-small.png\" src=\"https://www.biorxiv.org/sites/default/files/images/biorxiv_logo_homepage7-5-small.png\" /></p>DNA barcoding, the use of short genetic markers to identify and differentiate species, is a foundational tool in ecological and taxonomic research. The method has scaled rapidly with next-generation sequencing technologies, enabling the processing of thousands of specimens in parallel. Nanopore sequencing offers a flexible, low-cost alternative to other platforms, producing full-length reads in real time and supporting applications in remote settings. However, its comparatively high error rate complicates downstream processing, particularly when PCR co-amplifies multiple templates from a single specimen, reflecting pseudogenes, paralogs, or contaminants. We present a novel pipeline for DNA barcoding that resolves mixed sequence signals from Nanopore reads using unsupervised clustering and staged consensus generation, without relying on curated reference databases, taxonomic priors, or error models. Unlike existing approaches to curate Nanopore sequence data that assume a single dominant amplicon per sample or require large sequence divergence among amplicons, our method distinguishes variants differing by 0.15 percent. It combines column-weighted encodings, UMAP projection, and HDBSCAN clustering, followed by conservative consensus refinement. The pipeline was benchmarked and validated using datasets with known composition, including high-fidelity PacBio sequences. The results show that Nanopore barcoding, when paired with appropriate analysis tools, can recover biologically meaningful variation even in technically complex samples. The pipeline is particularly suited for specimens where divergent templates are often co-amplified, including mitochondrial pseudogenes or multicopy nuclear regions like ITS. As such, it provides a generalizable framework for high-resolution Nanopore analysis of complex amplicon data.",
    "published": "2025-12-29T22:13:49+00:00"
  },
  {
    "title": "The Evolution in Coma Molecular Composition of Comet C/2017 K2 (PanSTARRS) Across the H2O Sublimation Zone: ALMA Imaging of an H2O-Dominated Coma",
    "link": "https://astrobiology.com/2025/12/the-evolution-in-coma-molecular-composition-of-comet-c-2017-k2-panstarrs-across-the-h2o-sublimation-zone-alma-imaging-of-an-h2o-dominated-coma.html",
    "score": 81,
    "summary": "The study provides insights into the molecular composition of comet C/2017 K2, highlighting the presence of key volatiles that may inform our understanding of the chemical processes relevant to the origins of life.",
    "abstract": "<p>We report a survey of molecular emission from cometary volatiles using the Atacama Large Millimeter/Submillimeter Array (ALMA) toward comet C/2017 K2 (PanSTARRS) carried out on UT 2022 September 21, 22, and 23 at a heliocentric distance (rh) of 2.1 au. These measurements of HCN, CS, CO, CH3OH, and H2CO (along with continuum emission from dust) […]</p> \n<p>The post <a href=\"https://astrobiology.com/2025/12/the-evolution-in-coma-molecular-composition-of-comet-c-2017-k2-panstarrs-across-the-h2o-sublimation-zone-alma-imaging-of-an-h2o-dominated-coma.html\">The Evolution in Coma Molecular Composition of Comet C/2017 K2 (PanSTARRS) Across the H2O Sublimation Zone: ALMA Imaging of an H2O-Dominated Coma</a> appeared first on <a href=\"https://astrobiology.com\">Astrobiology</a>.</p>",
    "published": "2025-12-29T19:34:52+00:00"
  },
  {
    "title": "Stardust Study Resets How Life’s Atoms Spread Through Space",
    "link": "https://astrobiology.com/2025/12/stardust-study-resets-how-lifes-atoms-spread-through-space.html",
    "score": 85,
    "summary": "The study challenges previous notions about the mechanisms by which essential life-building atoms are distributed throughout the galaxy, suggesting that starlight and stardust alone are insufficient.",
    "abstract": "<p>Starlight and stardust are not enough to drive the powerful winds of giant stars, transporting the building blocks of life through our galaxy. That’s the conclusion of a new study from Chalmers University of Technology, Sweden, of red giant star R Doradus. The result overturns a long-held idea about how the atoms needed for life […]</p> \n<p>The post <a href=\"https://astrobiology.com/2025/12/stardust-study-resets-how-lifes-atoms-spread-through-space.html\">Stardust Study Resets How Life’s Atoms Spread Through Space</a> appeared first on <a href=\"https://astrobiology.com\">Astrobiology</a>.</p>",
    "published": "2025-12-29T19:34:52+00:00"
  },
  {
    "title": "Designing Peptide Fossils That Model the Evolution of the Bacterial Ferredoxin Fold",
    "link": "https://astrobiology.com/2025/12/designing-peptide-fossils-that-model-the-evolution-of-the-bacterial-ferredoxin-fold.html",
    "score": 85,
    "summary": "The study explores the evolutionary significance of bacterial ferredoxins as early protein electron carriers, providing insights into the origins of life and the development of metabolic processes.",
    "abstract": "<p>Electron transfer coupled to redox chemistry is at the heart of metabolism. The proteins responsible for moving electrons (protein electron carriers) must have emerged at the origin of life. The small iron–sulfur-binding bacterial ferredoxins were likely among these first proteins. Embedded within the ferredoxin sequence and structure is a symmetry that points to an ancient […]</p> \n<p>The post <a href=\"https://astrobiology.com/2025/12/designing-peptide-fossils-that-model-the-evolution-of-the-bacterial-ferredoxin-fold.html\">Designing Peptide Fossils That Model the Evolution of the Bacterial Ferredoxin Fold</a> appeared first on <a href=\"https://astrobiology.com\">Astrobiology</a>.</p>",
    "published": "2025-12-29T18:35:40+00:00"
  },
  {
    "title": "Why Estimating η⊕ Is Difficult: A Kepler-Centric Perspective",
    "link": "https://astrobiology.com/2025/12/why-estimating-is-difficult-a-kepler-centric-perspective.html",
    "score": 75,
    "summary": "The paper discusses the challenges in estimating the occurrence rate of rocky habitable zone exoplanets, η⊕, highlighting significant variability in estimates and its implications for understanding potential sites for abiogenesis.",
    "abstract": "<p>η⊕, the occurrence rate of rocky habitable zone exoplanets orbiting Sun-like stars, is of great interest to both the astronomical community and the general public. The Kepler space telescope has made it possible to estimate η⊕, but estimates by different groups vary by more than an order of magnitude. We identify several causes for this […]</p> \n<p>The post <a href=\"https://astrobiology.com/2025/12/why-estimating-is-difficult-a-kepler-centric-perspective.html\">Why Estimating η⊕ Is Difficult: A Kepler-Centric Perspective</a> appeared first on <a href=\"https://astrobiology.com\">Astrobiology</a>.</p>",
    "published": "2025-12-29T18:35:40+00:00"
  },
  {
    "title": "Elemental abundance pattern and temperature inversion on the dayside of HAT-P-70b observed with CARMENES and PEPSI",
    "link": "https://arxiv.org/abs/2512.21470",
    "score": 81,
    "summary": "The study of HAT-P-70b's atmosphere reveals significant insights into elemental abundances and thermal profiles, suggesting implications for planet formation and atmospheric dynamics relevant to the origins of life.",
    "abstract": "arXiv:2512.21470v1 Announce Type: new  \nAbstract: Ground-based high-resolution spectroscopy has identified various chemical species in the atmospheres of ultra-hot Jupiters, including neutral and ionized metals, providing key insights into planet formation through refractory element abundances. We observed the dayside thermal emission spectrum of the UHJ HAT-P-70b using the high-resolution spectrographs CARMENES and PEPSI. Through cross-correlation analysis, we detect emission signals of Al i, AlH, Ca ii, Cr i, Fe i, Fe ii, Mg i, Mn i, and Ti i, marking the first detection of Al i and AlH in an exoplanetary atmosphere. Tentative signals of C i, Ca i, Na i, NaH, and Ni i are also identified. These detections enable atmospheric retrievals to constrain the thermal profile and elemental abundances of the planet's dayside hemisphere. The retrieved temperature-pressure profile reveals a strong thermal inversion. The chemical free retrieval yields a metallicity of [Fe/H] = 0.38(+0.74/-1.11), while the chemical equilibrium retrieval gives [Fe/H] = 0.23(+1.08/-0.98), both consistent with solar metallicity. We also tentatively find an enhanced abundance of Ni, possibly due to the accretion of Ni-rich planetesimals during formation. On the other hand, elements with condensation temperatures above 1400 K (e.g., Ca, Ti, and V) appear slightly depleted, which may be caused by nightside cold trapping. However, Al, with the highest condensation temperature at 1653K, displays a solar like abundance, which might reflect the formation-related enrichment of Al. Our retrieval indicates extremely high volume mixing ratios of metal ions (Fe ii and Ca ii), which are significantly inconsistent with predictions from chemical equilibrium models. This disequilibrium suggests that the atmosphere is likely undergoing significant hydrodynamic escaping, which enhances the atmospheric density at high altitudes where the ionic lines are formed.",
    "published": "2025-12-29T05:46:20+00:00"
  },
  {
    "title": "Episodic planetesimal disruptions triggered by dissipation of gas disk",
    "link": "https://arxiv.org/abs/2512.21493",
    "score": 75,
    "summary": "The paper discusses how the dissipation of the gas disk in protoplanetary environments can trigger episodic catastrophic collisions of planetesimals, providing insights into the violent conditions that may influence the origins of life.",
    "abstract": "arXiv:2512.21493v1 Announce Type: new  \nAbstract: Catastrophic disruptions of planetesimals occur in high-velocity collisions. Radioisotope dating of planetesimal disruption events recorded in meteorites confirms frequent catastrophic collisions in the first $\\sim$10 Myr of the Solar System, reflecting a violent environment of the time. However, the nebula gas can damp the eccentricity of planetesimals and suppress the frequency of planetesimal collisions. Strong dynamical mechanisms that excited the protoplanetary disk are required. Here we show that the sweeping secular resonances of Jupiter and Saturn induced by the nebular gas dissipation, together with the mean motion resonances of Jupiter, can trigger a large number of catastrophic collisions, which occur episodically when the secular resonances are at $\\sim$2-3 au and continue thereafter. After the gas dissipation completes, catastrophic collisions decrease in frequency, with scattering by planetary embryos becoming the major driving force of the collisions. Our results suggest that the violent environment excited by secular and mean motion resonances can be ubiquitous in protoplanetary disks during nebula dissipation.",
    "published": "2025-12-29T05:46:20+00:00"
  },
  {
    "title": "Snowball Bistability Vanishes at Moderate Orbital Eccentricity",
    "link": "https://arxiv.org/abs/2509.08994",
    "score": 85,
    "summary": "The paper discusses how increased orbital eccentricity can eliminate climate bistability necessary for Snowball episodes, which are crucial for understanding the conditions that may support complex life on exoplanets.",
    "abstract": "arXiv:2509.08994v2 Announce Type: replace  \nAbstract: Snowball episodes are associated with increases in atmospheric oxygen and the complexity of life on Earth, and they may be essential for the development of complex life on exoplanets. Sustained, stable Snowball episodes require a Snowball bifurcation and climate bistability between the globally ice-covered Snowball state and a state with at least some open ocean. We find that climate bistability disappears for an aquaplanet with a slab ocean in the global climate model ExoCAM when the orbital eccentricity is increased to 0.2-0.3. This happens because the Snowball state ceases to exist as seasonal insolation variations intensify, while the warm state remains stable due to the ocean's large heat capacity. We use a low-order ice-thermodynamic model to show that the Snowball state ceases to exist as seasonality increases because winter freezing at the ice bottom is reduced relative to summer melting at the ice top due to ice self-insulation. Combined with previous research showing that Snowball climate bistability diminishes for planets orbiting low-mass stars and ones with longer rotation periods, and that it disappears entirely for tidally locked planets, our work suggests that the Snowball climate bistability may not be as robust to planetary parameters as previously thought, representing one aspect of habitability more consistent with the rare Earth hypothesis than the Copernican principle.",
    "published": "2025-12-29T05:46:20+00:00"
  },
  {
    "title": "Habitability of exoplanets orbiting flaring stars",
    "link": "https://arxiv.org/abs/2512.21357",
    "score": 75,
    "summary": "The paper discusses the habitability of exoplanets orbiting flaring M-stars, highlighting the need for further research on the impact of stellar activity on the potential for complex life.",
    "abstract": "arXiv:2512.21357v1 Announce Type: cross  \nAbstract: As of late 2025 there are about 70 exoplanets that meet the formal criterion of having equilibrium temperatures allowing the presence of liquid water and about 50 of them orbit M-stars, known for their strong chromospheric activity. Most of these stars are close to the Sun and the planet-to-star mass and luminosity ratios are advantageous, allowing for a more detailed follow-up than of planets orbiting hotter and more massive stars. Many more planets orbiting late-type stars are expected to be discovered by Gaia and PLATO in the following years. However, the lingering question remains whether the UV and X-ray emission, associated with the stellar activity, allows for complex life. A comprehensive study focused on properties of flaring exoplanet hosts and their activity, on a much larger scale than these few tens (soon to become hundreds) of stars with habitable planets is called for, to answer the question if such stars can harbor habitable planets. The proposed Wide Field Survey telescope is well suited for this study.",
    "published": "2025-12-29T05:46:20+00:00"
  },
  {
    "title": "High-energy astrochemistry in the molecular interstellar medium",
    "link": "https://arxiv.org/abs/2512.10060",
    "score": 85,
    "summary": "The paper highlights the significance of high-energy astrochemistry in the formation of complex organic molecules in the interstellar medium, suggesting that non-thermal processes may play a crucial role in the origins of life.",
    "abstract": "arXiv:2512.10060v2 Announce Type: replace-cross  \nAbstract: In the past decade, there has been a significant shift in astrochemistry with a renewed focus on the role of non-thermal processes on the molecular interstellar medium, in particular energetic particles (such as cosmic ray particles and fast electrons) and X-ray radiation. This has been brought about in large part due to new observations of interstellar complex organic molecules (iCOMS) in environments that would inhibit their formation, such as cold, dense gas in prestellar cores or in the highly energetic environments in galactic centers. In parallel, there has been a plethora of new laboratory investigations on the role of high-energy radiation and electrons on the chemistry of astrophysical ices, demonstrating the ability of this radiation to induce complex chemistry. In recent years, theoretical models have also begun to include newer cosmic-ray-driven processes in both the gas and ice phases. In this review, we unify aspects of the chemistry driven by X-ray radiation and energetic particles into a ``high-energy astrochemistry'', defining this term and reviewing the underlying chemical processes. We conclude by examining various laboratories where high-energy astrochemistry is at play and identify future issues to be tackled.",
    "published": "2025-12-29T05:46:20+00:00"
  }
]