[
  {
    "title": "Cultural accumulation or stasis? The impact of imitation and early teaching on hominin cultural evolution",
    "summary": "<p>Publication date: December 2025</p><p><b>Source:</b> BioSystems, Volume 258</p><p>Author(s): Laureano Castro, Daniel Castro-Cañadilla, Miguel Ángel Castro-Nogueira, Miguel Ángel Toro</p>",
    "url": "https://www.sciencedirect.com/science/article/pii/S0303264725002515?dgcid=rss_sd_all",
    "published_date": "2026-01-03T15:00:00Z",
    "source_feed": "Biosystems",
    "hunted_links": [],
    "analysis_result": {
      "score": 5,
      "summary": "A modeling/theoretical study of how imitation and early teaching affect hominin cultural accumulation or stasis, relevant to \"evolution\" in a behavioral sense but not to astrobiology or origins-of-life chemistry."
    }
  },
  {
    "title": "The Natural history of the transition between RNA to DNA in the early stages of life",
    "summary": "<p>Publication date: January 2026</p><p><b>Source:</b> BioSystems, Volume 259</p><p>Author(s): Sávio Torres de Farias, Marco José</p>",
    "url": "https://www.sciencedirect.com/science/article/pii/S0303264725002813?dgcid=rss_sd_all",
    "published_date": "2026-01-03T15:00:00Z",
    "source_feed": "Biosystems",
    "hunted_links": [],
    "analysis_result": {
      "score": 88,
      "summary": "Reviews the natural history and proposed mechanisms underlying the early-life transition from RNA-based systems to DNA-based genetics, a core topic in origins-of-life research."
    }
  },
  {
    "title": "Heuristic Model On The Origin Of The Homochirality Of Life Heuristic Model On The Origin Of The Homochirality Of life",
    "summary": "<p>Life demonstrates remarkable homochirality of its major building blocks: nucleic acids, amino acids, sugars, and phospholipids. We propose a mechanism that places the root of life homochirality in the formation of phospholipid bilayer vesicles (liposomes). These liposomes are formed at the water-air interface from Langmuir layers and contain ribose, presumably delivered to Early Earth by [&#8230;]</p>\n<p>The post <a href=\"https://astrobiology.com/2026/01/heuristic-model-on-the-origin-of-the-homochirality-of-life-heuristic-model-on-the-origin-of-the-homochirality-of-life.html\">Heuristic Model On The Origin Of The Homochirality Of Life Heuristic Model On The Origin Of The Homochirality Of life</a> appeared first on <a href=\"https://astrobiology.com\">Astrobiology</a>.</p>",
    "url": "https://astrobiology.com/2026/01/heuristic-model-on-the-origin-of-the-homochirality-of-life-heuristic-model-on-the-origin-of-the-homochirality-of-life.html",
    "published_date": "2026-01-02T16:39:23Z",
    "source_feed": "Astrobiology (astrobiology.com)",
    "hunted_links": [
      "https://doi.org/10.48550/arXiv.2512.11136",
      "https://arxiv.org/abs/2512.11136"
    ],
    "analysis_result": {
      "score": 98,
      "summary": "An origins-of-life homochirality hypothesis proposing that phospholipid bilayer vesicle self-assembly at the water–air interface could bias chirality and propagate homochirality into ribose/nucleic-acid chemistry."
    }
  },
  {
    "title": "Offworld Biotechnology Research: Advanced Space Experiment Processor-4 (ADSEP-4)",
    "summary": "<p>NASA astronaut and Expedition 73 Flight Engineer Zena Cardman inspects sample cassettes for installation into the Advanced Space Experiment Processor-4 (ADSEP-4) at the maintenance work area inside the International Space Station&#8217;s Harmony module. She was conducting research operations for the Pharmaceutical In-space Laboratory biotechnology experiment, which is investigating methods to advance pharmaceutical manufacturing in microgravity. [&#8230;]</p>\n<p>The post <a href=\"https://astrobiology.com/2026/01/offworld-biotechnology-research-advanced-space-experiment-processor-4-adsep-4.html\">Offworld Biotechnology Research: Advanced Space Experiment Processor-4 (ADSEP-4)</a> appeared first on <a href=\"https://astrobiology.com\">Astrobiology</a>.</p>",
    "url": "https://astrobiology.com/2026/01/offworld-biotechnology-research-advanced-space-experiment-processor-4-adsep-4.html",
    "published_date": "2026-01-02T16:44:55Z",
    "source_feed": "Astrobiology (astrobiology.com)",
    "hunted_links": [],
    "analysis_result": {
      "score": 25,
      "summary": "ISS-based biotechnology work using the ADSEP-4 processor to support microgravity pharmaceutical manufacturing, with only indirect relevance to origins-of-life research."
    }
  },
  {
    "title": "On the transitional character and regularity of planetary abiogenesis",
    "summary": "<p>Publication date: January 2026</p><p><b>Source:</b> BioSystems, Volume 259</p><p>Author(s): Serge Dolgikh</p>",
    "url": "https://www.sciencedirect.com/science/article/pii/S0303264725002709?dgcid=rss_sd_all",
    "published_date": "2026-01-03T15:00:00Z",
    "source_feed": "Biosystems",
    "hunted_links": [],
    "analysis_result": {
      "score": 85,
      "summary": "This BioSystems (Jan 2026) paper appears to address the general principles and transitional regularities of planetary abiogenesis, making it a core origins-of-life topic despite limited available metadata."
    }
  },
  {
    "title": "A moments-based approach for inferring mechanisms of transcriptional regulation using nascent RNA data",
    "summary": "Unraveling the kinetics of transcriptional regulation is a central challenge in molecular biology. Traditional inference methods based on cell-to-cell mRNA variability are limited because mRNA levels reflect not only transcriptional activity but also post-transcriptional processes. Recent advances in quantifying nascent RNAs across isogenic cells provide a more direct readout of transcriptional dynamics. Here, we present a moments-based theoretical framework that leverages nascent RNA data to infer transcriptional kinetics. We derive closed-form expressions for the first two time-dependent moments of nascent RNA across three canonical transcription models and demonstrate that nascent RNA exhibits distinct transient overshoots and higher Fano factors compared to mature mRNA. Through analysis of synthetic datasets, we show that these features enable more accurate estimation of transcriptional kinetics and allow reliable model selection, distinguishing single from multi-pathway promoter activation with over 75% accuracy even from small sample sizes. We further validated our model selection method using real experimental transcription datasets in yeast and E. coli cells, with nascent RNA demonstrating superior performance in identifying cross-talk pathway regulation. Our framework thus offers a computationally efficient and mechanistically informative approach for decoding transcriptional dynamics, emphasizing the advantages of time-dependent nascent RNA measurements over mature mRNA in capturing the true kinetics of transcriptional regulation.",
    "url": "https://www.biorxiv.org/content/10.64898/2026.01.03.697452v1?rss=1",
    "published_date": "2026-01-03T00:00:00Z",
    "source_feed": "biophysics - biorXiv Preprints",
    "hunted_links": [],
    "analysis_result": {
      "score": 25,
      "summary": "Presents a moments-based framework to infer transcriptional regulation mechanisms from single-cell nascent RNA time-course data, improving kinetic parameter estimation and model selection compared to mature mRNA."
    }
  },
  {
    "title": "Recent Production Rates Of Cosmogenic Nuclides In The Igneous Rocks of Jezero Crater Floor, Mars",
    "summary": "<p>The Perseverance rover has collected rock samples from the floor of Jezero crater, Mars, set to be returned to Earth through the Mars Sample Return (MSR) mission. These surface rocks are continuously bombarded by cosmic rays, resulting in the formation of cosmogenic nuclides. To accurately date these rocks and understand past geological events, precise estimates [&#8230;]</p>\n<p>The post <a href=\"https://astrobiology.com/2026/01/recent-production-rates-of-cosmogenic-nuclides-in-the-igneous-rocks-of-jezero-crater-floor-mars.html\">Recent Production Rates Of Cosmogenic Nuclides In The Igneous Rocks of Jezero Crater Floor, Mars</a> appeared first on <a href=\"https://astrobiology.com\">Astrobiology</a>.</p>",
    "url": "https://astrobiology.com/2026/01/recent-production-rates-of-cosmogenic-nuclides-in-the-igneous-rocks-of-jezero-crater-floor-mars.html",
    "published_date": "2026-01-02T16:34:24Z",
    "source_feed": "Astrobiology (astrobiology.com)",
    "hunted_links": [
      "https://www.nature.com/articles/s41598-025-33031-5?utm_source=xmol&utm_medium=affiliate&utm_content=meta&utm_campaign=DDCN_1_GL01_metadata_scirep"
    ],
    "analysis_result": {
      "score": 55,
      "summary": "Quantifies cosmogenic nuclide production rates in Perseverance’s Jezero crater igneous rocks to improve exposure-age constraints and geological timeline calibration for Mars Sample Return context relevant to assessing past Martian habitability."
    }
  },
  {
    "title": "Lava Tubes On Earth, the Moon, And Mars: Detection, Evolution, And Exploration Potential",
    "summary": "<p>Lava tubes, or subsurface conduits formed by volcanic activity, have emerged as critical geological features for understanding planetary evolution and for supporting future human space exploration. This paper provides an integrated review of the formation, morphology, and preservation of lava tubes on Earth, the Moon, and Mars, emphasizing their geological significance and habitability potential. We [&#8230;]</p>\n<p>The post <a href=\"https://astrobiology.com/2026/01/lava-tubes-on-earth-the-moon-and-mars-detection-evolution-and-exploration-potential.html\">Lava Tubes On Earth, the Moon, And Mars: Detection, Evolution, And Exploration Potential</a> appeared first on <a href=\"https://astrobiology.com\">Astrobiology</a>.</p>",
    "url": "https://astrobiology.com/2026/01/lava-tubes-on-earth-the-moon-and-mars-detection-evolution-and-exploration-potential.html",
    "published_date": "2026-01-02T16:27:44Z",
    "source_feed": "Astrobiology (astrobiology.com)",
    "hunted_links": [
      "https://doi.org/10.1007/s11214-025-01260-9",
      "https://link.springer.com/article/10.1007/s11214-025-01260-9"
    ],
    "analysis_result": {
      "score": 65,
      "summary": "Review of lava tube formation and detection on Earth, the Moon, and Mars, highlighting their potential as protected habitable environments relevant to astrobiology and future exploration."
    }
  },
  {
    "title": "Authigenic Biosignatures Of Microbial Biomass Preserved As Carbonate Ooids Formed By Abiotic Chemically Oscillating Reactions Throughout Earth History",
    "summary": "<p>Ooids are small spheroidal carbonate grains that have circularly concentric and radially aligned crystals. Oolitic carbonates are commonly associated with fossils or organic matter, which has led to hypothetical formation models involving both biological and abiotic processes. The most commonly invoked model involves precipitates from supersaturated CaCO3 water under high-energy conditions. However, this model does [&#8230;]</p>\n<p>The post <a href=\"https://astrobiology.com/2026/01/authigenic-biosignatures-of-microbial-biomass-preserved-as-carbonate-ooids-formed-by-abiotic-chemically-oscillating-reactions-throughout-earth-history.html\">Authigenic Biosignatures Of Microbial Biomass Preserved As Carbonate Ooids Formed By Abiotic Chemically Oscillating Reactions Throughout Earth History</a> appeared first on <a href=\"https://astrobiology.com\">Astrobiology</a>.</p>",
    "url": "https://astrobiology.com/2026/01/authigenic-biosignatures-of-microbial-biomass-preserved-as-carbonate-ooids-formed-by-abiotic-chemically-oscillating-reactions-throughout-earth-history.html",
    "published_date": "2026-01-02T16:23:15Z",
    "source_feed": "Astrobiology (astrobiology.com)",
    "hunted_links": [
      "https://doi.org/10.1130/B38526.1/666459/Authigenic-biosignatures-of-microbial-biomass",
      "https://pubs.geoscienceworld.org/gsa/gsabulletin/article/doi/10.1130/B38526.1/666459/Authigenic-biosignatures-of-microbial-biomass"
    ],
    "analysis_result": {
      "score": 65,
      "summary": "Proposes that carbonate ooids can form via abiotic chemically oscillating reactions while preserving authigenic microbial biomass, informing how carbonate textures may act as biosignature traps and potential false-positive/ambiguous biosignatures through Earth history."
    }
  },
  {
    "title": "Nucleolar reorganization on stress depends on physicochemical changes due to nascent rRNA synthesis",
    "summary": "Successive maturation of ribosomal subunits occurs through multi-layered phase-separated structures of the cell nucleolus. The spatio-functional relationship between transcription of rRNA and nucleolar substructures and how this adapts to cellular stress remain incompletely understood. In this study, we resolve the sub nucleolar structures using expansion microscopy to reveal ordered structures of fibrillar center (FC) and dense fibrillar component (DFC) domains as nested shells, which is reorganized upon cellular stress like DNA damage or RNA polymerase I (RNAPI) inhibition. Direct visualization of nascent (5' ETS) and mature (28S) rRNA suggested that rRNA synthesis is the critical regulator of nucleolar size, and organization. Nucleolar reorganization upon stress emerges to be a direct function of nascent rRNA levels. Stress-induced transcription inhibition remodels the sub-nucleolar compartments from a viscoelastic state into solid-like condensates thereby perturbing the nucleolar pH gradient due to the missing rRNA scaffold. We show, that rather than signalling to mediate rDNA repair, nucleolar reorganization naturally arises primarily from reduced rRNA levels and the resultant biophysical restructuring of the nucleolus under cellular stress.",
    "url": "https://www.biorxiv.org/content/10.64898/2026.01.03.697456v1?rss=1",
    "published_date": "2026-01-03T00:00:00Z",
    "source_feed": "cell biology - biorXiv Preprints",
    "hunted_links": [],
    "analysis_result": {
      "score": 45,
      "summary": "Using expansion microscopy, this study shows nucleolar phase-separated subcompartments reorganize under stress primarily due to reduced nascent rRNA synthesis, shifting condensates toward more solid-like states and altering physicochemical gradients—relevant mainly as a modern-cell example of RNA-dependent self-organization."
    }
  },
  {
    "title": "Prevalence of prime mass residues in single point mutations and their importance to protein stability, function and evolution",
    "summary": "<p>Publication date: December 2025</p><p><b>Source:</b> BioSystems, Volume 258</p><p>Author(s): Matthew Wright, Kevin M. Downard</p>",
    "url": "https://www.sciencedirect.com/science/article/pii/S0303264725002485?dgcid=rss_sd_all",
    "published_date": "2026-01-03T15:00:00Z",
    "source_feed": "Biosystems",
    "hunted_links": [],
    "analysis_result": {
      "score": 45,
      "summary": "Examines how prime-mass amino-acid residue patterns influence the impact of single-point mutations on protein stability and evolution, offering indirect context for molecular evolution rather than a direct origins-of-life focus."
    }
  },
  {
    "title": "Spatial Sucrose Sink Profiles Shape Phloem Transport Efficiency and Xylem-Phloem Water Exchange",
    "summary": "<p>Publication date: Available online 24 December 2025</p><p><b>Source:</b> Journal of Theoretical Biology</p><p>Author(s): Mazen Nakad, Aaron Potkay, Marc A. Hesse, Maurizio Mencuccini, Pierre Gentine, Ensheng Weng</p>",
    "url": "https://www.sciencedirect.com/science/article/pii/S0022519325003303?dgcid=rss_sd_all",
    "published_date": "2026-01-03T15:00:00Z",
    "source_feed": "Journal of Theoretical Biology",
    "hunted_links": [],
    "analysis_result": {
      "score": 0,
      "summary": "A theoretical biology study of how sucrose sink spatial profiles affect plant phloem transport and xylem–phloem water exchange, with no direct relevance to origins-of-life or astrobiology topics."
    }
  },
  {
    "title": "A liquid neural network with physical evolution for variable continuous time series prediction",
    "summary": "<p>Publication date: February 2026</p><p><b>Source:</b> Journal of Computational Science, Volume 94</p><p>Author(s): Kui Qian, Yue Deng, Zhengyan Li, Xiulan Wen</p>",
    "url": "https://www.sciencedirect.com/science/article/pii/S1877750325002340?dgcid=rss_sd_all",
    "published_date": "2026-01-03T15:00:00Z",
    "source_feed": "Journal of Computational Science",
    "hunted_links": [],
    "analysis_result": {
      "score": 5,
      "summary": "Machine-learning paper on liquid neural networks and 'physical evolution' for continuous time-series prediction, with no clear connection to origins-of-life chemistry, astrobiology, or prebiotic processes beyond the generic term 'evolution'."
    }
  },
  {
    "title": "Evidence of upright walking found in 7-million-year-old Sahelanthropus fossils",
    "summary": "In recent decades, scientists have debated whether a seven-million-year-old fossil was bipedal—a trait that would make it the oldest human ancestor. A new analysis by a team of anthropologists offers powerful evidence that Sahelanthropus tchadensis—a species discovered in the early 2000s—was indeed bipedal by uncovering a feature found only in bipedal hominins.",
    "url": "https://phys.org/news/2025-12-evidence-upright-million-year-sahelanthropus.html",
    "published_date": "2026-01-02T19:00:05Z",
    "source_feed": "Phys.org: Evolution News",
    "hunted_links": [],
    "analysis_result": {
      "score": 25,
      "summary": "A paleoanthropology study presenting evidence for bipedalism in 7-million-year-old Sahelanthropus, relevant mainly to human evolution rather than origins-of-life or astrobiology."
    }
  },
  {
    "title": "Remodeling of non-coding RNA regulatory networks: Decoding the pathological mechanisms and new therapeutic paradigms of cardiovascular diseases",
    "summary": "<p>Publication date: March 2026</p><p><b>Source:</b> Physics of Life Reviews, Volume 56</p><p>Author(s): Wangzheqi Zhang, Lei Duan, Changli Wang, Yan Liao, Rui Zhao, Zhaoyu Li, Haoling Zhang, Zengwu Wang, Jing-jing Zhang</p>",
    "url": "https://www.sciencedirect.com/science/article/pii/S1571064525001836?dgcid=rss_sd_all",
    "published_date": "2026-01-03T15:00:00Z",
    "source_feed": "Physics of Life Reviews",
    "hunted_links": [],
    "analysis_result": {
      "score": 5,
      "summary": "A biomedical review on non-coding RNA regulatory network remodeling in cardiovascular disease, with only tangential relevance to origins-of-life via the general concept of RNA."
    }
  },
  {
    "title": "On implementation of nonlocal terms in models in ecology and evolution. Comment on `Nonlocal models in biology and life sciences: Sources, developments, and applications' by S. Pal and R. Melnic",
    "summary": "<p>Publication date: Available online 26 December 2025</p><p><b>Source:</b> Physics of Life Reviews</p><p>Author(s): Andrew Yu Morozov</p>",
    "url": "https://www.sciencedirect.com/science/article/pii/S1571064525001897?dgcid=rss_sd_all",
    "published_date": "2026-01-03T15:00:00Z",
    "source_feed": "Physics of Life Reviews",
    "hunted_links": [],
    "analysis_result": {
      "score": 30,
      "summary": "A technical comment on implementing nonlocal terms in ecological and evolutionary models, offering general theoretical context but little direct relevance to origins-of-life or astrobiology topics."
    }
  },
  {
    "title": "Flowering plant origins: Dosage-sensitive genes suggest no whole-genome duplications in ancestral angiosperm",
    "summary": "Angiosperms, also known as flowering plants, represent the most diverse group of seed plants, and their origin and evolution have long been a central question in plant evolutionary biology. Whole-genome duplication (WGD), or polyploidization, is widely recognized as a key driver of the origin and trait evolution of both seed plants and angiosperms.",
    "url": "https://phys.org/news/2026-01-dosage-sensitive-genes-genome-duplications.html",
    "published_date": "2026-01-02T19:00:08Z",
    "source_feed": "Phys.org: Evolution News",
    "hunted_links": [],
    "analysis_result": {
      "score": 20,
      "summary": "Analyzes whether whole-genome duplications occurred in ancestral flowering plants using dosage-sensitive genes, offering general evolutionary context but little direct relevance to origins-of-life or astrobiology."
    }
  },
  {
    "title": "Episodic positive selection structurally stabilizes the <i>Arabidopsis</i> CONSTANS-like gene COL5 indicating adaptive evolution",
    "summary": "<p>Scientific Reports, Published online: 03 January 2026; <a href=\"https://www.nature.com/articles/s41598-025-34129-6\">doi:10.1038/s41598-025-34129-6</a></p>Episodic positive selection structurally stabilizes the <i>Arabidopsis</i> CONSTANS-like gene COL5 indicating adaptive evolution",
    "url": "https://www.nature.com/articles/s41598-025-34129-6",
    "published_date": "2026-01-03T00:00:00Z",
    "source_feed": "Scientific Reports",
    "hunted_links": [
      "https://www.nature.com/npg_/press_room/press_releases.html",
      "https://www.nature.com/srep.rss",
      "https://authorservices.springernature.com/scientific-editing/",
      "https://support.nature.com/support/home",
      "https://journal-alerts.springernature.com/subscribe?journal_id=41598",
      "https://www.nature.com/immersive/natureawards/index.html",
      "https://author-welcome.nature.com/41598",
      "https://www.nature.com/authors/editorial_policies",
      "https://citation-needed.springer.com/v2/references/10.1038/s41598-025-34129-6?format=refman&flavour=references",
      "https://www.nature.com/briefing/signup/?brieferEntryPoint=MainBriefingBanner",
      "https://www.nature.com/openresearch/about-open-access/information-for-institutions",
      "https://authorservices.springernature.com/go/sn/?utm_source=For+Authors&utm_medium=Website_Nature&utm_campaign=Platform+Experimentation+2022&utm_id=PE2022",
      "https://www.nature.com/npg_/company_info/index.html",
      "https://www.nature.com/subjects",
      "https://www.nature.com/naturecareers/",
      "https://www.springernature.com/gp/librarians/tools-services",
      "https://solutions.springernature.com/",
      "https://www.nature.com/natafrica",
      "https://authorservices.springernature.com/language-editing/",
      "https://www.nature.com/nindia",
      "https://www.springernature.com/gp/librarians/recommend-to-your-library",
      "https://www.springernature.com/gp/librarians/manage-your-account/librarianportal",
      "https://doi.org/10.1101/2025.04.03.646976",
      "https://masterclasses.nature.com/",
      "https://www.springernature.com/",
      "https://www.springernature.com/ccpa",
      "https://doi.org/10.32942/X2P62N",
      "https://doi.org/10.1038/s41598-025-34129-6",
      "https://press.nature.com/",
      "https://www.nature.com/reprints",
      "https://www.springernature.com/gp/authors/research-data",
      "https://www.nature.com/nmiddleeast",
      "https://www.nature.com/nature-research/open-access",
      "https://conferences.nature.com",
      "https://citation-needed.springer.com/v2/references/10.1038/s41598-025-34129-6?format=refman&flavour=citation"
    ],
    "analysis_result": {
      "score": 15,
      "summary": "Reports episodic positive selection and predicted structural stabilization in the Arabidopsis CONSTANS-like gene COL5, indicating adaptive evolution in a plant regulatory protein with minimal direct relevance to origins-of-life questions."
    }
  },
  {
    "title": "Two white-blooded fish, two paths: Icefish and noodlefish independently lose red blood cell function",
    "summary": "Antarctic icefish are famous for living without red blood cells, but they are not alone. A species of needle-shaped, warm-water fish called the Asian noodlefish also lacks hemoglobin and red blood cells. Like icefish, its veins are filled with translucent white blood, said H. William Detrich, professor emeritus of marine and environmental sciences, who collaborated with Chinese scientists on a paper about the strange aquatic creatures published in Current Biology.",
    "url": "https://phys.org/news/2026-01-white-blooded-fish-paths-icefish.html",
    "published_date": "2026-01-02T16:45:17Z",
    "source_feed": "Phys.org: Evolution News",
    "hunted_links": [],
    "analysis_result": {
      "score": 15,
      "summary": "Comparative evolutionary biology study showing two fish lineages independently lost hemoglobin/red blood cells, offering only indirect context for astrobiology/origins-of-life discussions about the flexibility of complex life physiology."
    }
  }
]